In [1]:
# Código em https://quantbrasil.com.br/como-criar-seu-proprio-banco-de-dados-de-acoes-utilizando-python-e-sql

import pandas as pd
import numpy as np

In [2]:
import yfinance as yf

In [3]:
from sqlalchemy import create_engine

In [4]:
import psycopg2

# Precisei colocar isso para conseguir me livrar de um erro de certificado SSL durante leitura do arquivo
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [5]:
def get_ibov_info():
    url = "http://bvmf.bmfbovespa.com.br/indices/ResumoCarteiraTeorica.aspx?Indice=IBOV&amp;idioma=pt-br"
    html = pd.read_html(url, decimal=",", thousands=".")[0][:-1]
    df = html.copy()[['Código', 'Ação', 'Tipo']]
    df.rename(columns={
        'Código': 'symbol',
        'Ação': 'name',
        'Tipo': 'type'
    }, inplace=True)
    return df

#asset = get_ibov_info()
#asset

In [5]:
# Para pegar a carteira IBOV tem que ir no site da B3 e baixar o arquivo csv
# Link: http://bvmf.bmfbovespa.com.br/indices/ResumoCarteiraTeorica.aspx?Indice=IBOV&amp;idioma=pt-br
# Link 2: https://www.b3.com.br/pt_br/market-data-e-indices/indices/indices-amplos/indice-ibovespa-ibovespa-composicao-da-carteira.htm
# No final da página tem o link para baixar a carteira.
def get_carteira_ibov():
    arquivo = "../data/IBOV.csv"
    df = pd.read_csv(arquivo, sep=";", index_col=False, engine='python', skiprows=1, skipfooter=2, decimal=",", thousands=".", encoding="windows-1252")
    df.rename(columns={
        'Código': 'symbol',
        'Ação': 'name',
        'Tipo': 'type',
        'Qtde. Teórica': 'qte_teorica',
        'Part. (%)': 'participacao'
    }, inplace=True)
    return df

carteira_IBOV = get_carteira_ibov()
carteira_IBOV

   symbol          name        type  qte_teorica  participacao
0   RRRP3  3R PETROLEUM  ON      NM    199733824         0.361
1   ALPA4    ALPARGATAS  PN      N1    167963777         0.233
2   ABEV3     AMBEV S/A          ON   4359908680         3.085
3   AMER3    AMERICANAS  ON      NM    397635158         0.642
4   ASAI3         ASSAI  ON      NM    794310097         0.465
..    ...           ...         ...          ...           ...
88  VALE3          VALE  ON      NM   3843570705        16.499
89  VIIA3           VIA  ON      NM   1596295753         0.311
90  VBBR3         VIBRA  ON      NM   1131883365         1.130
91  WEGE3           WEG  ON      NM   1484859030         2.204
92  YDUQ3    YDUQS PART  ON      NM    300833122         0.282

[93 rows x 5 columns]

In [6]:
asset = carteira_IBOV.drop(columns=['qte_teorica', 'participacao'])
asset['yf_symbol'] = asset['symbol'] + '.SA'
asset

   symbol          name        type yf_symbol
0   RRRP3  3R PETROLEUM  ON      NM  RRRP3.SA
1   ALPA4    ALPARGATAS  PN      N1  ALPA4.SA
2   ABEV3     AMBEV S/A          ON  ABEV3.SA
3   AMER3    AMERICANAS  ON      NM  AMER3.SA
4   ASAI3         ASSAI  ON      NM  ASAI3.SA
..    ...           ...         ...       ...
88  VALE3          VALE  ON      NM  VALE3.SA
89  VIIA3           VIA  ON      NM  VIIA3.SA
90  VBBR3         VIBRA  ON      NM  VBBR3.SA
91  WEGE3           WEG  ON      NM  WEGE3.SA
92  YDUQ3    YDUQS PART  ON      NM  YDUQ3.SA

[93 rows x 4 columns]

In [7]:
insert_initial = """
    INSERT INTO asset(symbol, name, type, yf_symbol)
    VALUES
"""

values = ",".join(["('{}', '{}', '{}', '{}')".format(row["symbol"], row["name"], row["type"], row["yf_symbol"]) for symbol, row in asset.iterrows()])

insert_end = """
    ON CONFLICT (symbol) do UPDATE
    SET
    symbol = EXCLUDED.symbol,
    name = EXCLUDED.name,
    type = EXCLUDED.type,
    yf_symbol = EXCLUDED.yf_symbol;
"""

query = insert_initial + values + insert_end
print(query)

    INSERT INTO asset(symbol, name, type, yf_symbol)
    VALUES
('RRRP3', '3R PETROLEUM', 'ON      NM', 'RRRP3.SA'),('ALPA4', 'ALPARGATAS', 'PN      N1', 'ALPA4.SA'),('ABEV3', 'AMBEV S/A', 'ON', 'ABEV3.SA'),('AMER3', 'AMERICANAS', 'ON      NM', 'AMER3.SA'),('ASAI3', 'ASSAI', 'ON      NM', 'ASAI3.SA'),('AZUL4', 'AZUL', 'PN      N2', 'AZUL4.SA'),('B3SA3', 'B3', 'ON      NM', 'B3SA3.SA'),('BIDI11', 'BANCO INTER', 'UNT     N2', 'BIDI11.SA'),('BPAN4', 'BANCO PAN', 'PN      N1', 'BPAN4.SA'),('BBSE3', 'BBSEGURIDADE', 'ON      NM', 'BBSE3.SA'),('BRML3', 'BR MALLS PAR', 'ON      NM', 'BRML3.SA'),('BBDC3', 'BRADESCO', 'ON      N1', 'BBDC3.SA'),('BBDC4', 'BRADESCO', 'PN      N1', 'BBDC4.SA'),('BRAP4', 'BRADESPAR', 'PN      N1', 'BRAP4.SA'),('BBAS3', 'BRASIL', 'ON      NM', 'BBAS3.SA'),('BRKM5', 'BRASKEM', 'PNA     N1', 'BRKM5.SA'),('BRFS3', 'BRF SA', 'ON      NM', 'BRFS3.SA'),('BPAC11', 'BTGP BANCO', 'UNT     N2', 'BPAC11.SA'),('CRFB3', 'CARREFOUR BR', 'ON      NM', 'CRFB3.SA'),('CCRO3', 'CCR SA', 'ON      NM', 'CCRO3.SA'),('CMIG4', 'CEMIG', 'PN      N1', 'CMIG4.SA'),('CIEL3', 'CIELO', 'ON      NM', 'CIEL3.SA'),('COGN3', 'COGNA ON', 'ON      NM', 'COGN3.SA'),('CPLE6', 'COPEL', 'PNB     N2', 'CPLE6.SA'),('CSAN3', 'COSAN', 'ON      NM', 'CSAN3.SA'),('CPFE3', 'CPFL ENERGIA', 'ON      NM', 'CPFE3.SA'),('CMIN3', 'CSNMINERACAO', 'ON      N2', 'CMIN3.SA'),('CVCB3', 'CVC BRASIL', 'ON      NM', 'CVCB3.SA'),('CYRE3', 'CYRELA REALT', 'ON      NM', 'CYRE3.SA'),('DXCO3', 'DEXCO', 'ON      NM', 'DXCO3.SA'),('ECOR3', 'ECORODOVIAS', 'ON      NM', 'ECOR3.SA'),('ELET3', 'ELETROBRAS', 'ON      N1', 'ELET3.SA'),('ELET6', 'ELETROBRAS', 'PNB     N1', 'ELET6.SA'),('EMBR3', 'EMBRAER', 'ON      NM', 'EMBR3.SA'),('ENBR3', 'ENERGIAS BR', 'ON      NM', 'ENBR3.SA'),('ENGI11', 'ENERGISA', 'UNT     N2', 'ENGI11.SA'),('ENEV3', 'ENEVA', 'ON      NM', 'ENEV3.SA'),('EGIE3', 'ENGIE BRASIL', 'ON      NM', 'EGIE3.SA'),('EQTL3', 'EQUATORIAL', 'ON      NM', 'EQTL3.SA'),('EZTC3', 'EZTEC', 'ON      NM', 'EZTC3.SA'),('FLRY3', 'FLEURY', 'ON      NM', 'FLRY3.SA'),('GGBR4', 'GERDAU', 'PN      N1', 'GGBR4.SA'),('GOAU4', 'GERDAU MET', 'PN      N1', 'GOAU4.SA'),('GOLL4', 'GOL', 'PN      N2', 'GOLL4.SA'),('NTCO3', 'GRUPO NATURA', 'ON      NM', 'NTCO3.SA'),('SOMA3', 'GRUPO SOMA', 'ON      NM', 'SOMA3.SA'),('HAPV3', 'HAPVIDA', 'ON      NM', 'HAPV3.SA'),('HYPE3', 'HYPERA', 'ON      NM', 'HYPE3.SA'),('IGTI11', 'IGUATEMI S.A', 'UNT     N1', 'IGTI11.SA'),('GNDI3', 'INTERMEDICA', 'ON      NM', 'GNDI3.SA'),('IRBR3', 'IRBBRASIL RE', 'ON      NM', 'IRBR3.SA'),('ITSA4', 'ITAUSA', 'PN  EJ  N1', 'ITSA4.SA'),('ITUB4', 'ITAUUNIBANCO', 'PN      N1', 'ITUB4.SA'),('JBSS3', 'JBS', 'ON      NM', 'JBSS3.SA'),('JHSF3', 'JHSF PART', 'ON      NM', 'JHSF3.SA'),('KLBN11', 'KLABIN S/A', 'UNT     N2', 'KLBN11.SA'),('RENT3', 'LOCALIZA', 'ON      NM', 'RENT3.SA'),('LCAM3', 'LOCAMERICA', 'ON      NM', 'LCAM3.SA'),('LWSA3', 'LOCAWEB', 'ON      NM', 'LWSA3.SA'),('LAME4', 'LOJAS AMERIC', 'PN      N1', 'LAME4.SA'),('LREN3', 'LOJAS RENNER', 'ON      NM', 'LREN3.SA'),('MGLU3', 'MAGAZ LUIZA', 'ON      NM', 'MGLU3.SA'),('MRFG3', 'MARFRIG', 'ON      NM', 'MRFG3.SA'),('CASH3', 'MELIUZ', 'ON      NM', 'CASH3.SA'),('BEEF3', 'MINERVA', 'ON      NM', 'BEEF3.SA'),('MRVE3', 'MRV', 'ON      NM', 'MRVE3.SA'),('MULT3', 'MULTIPLAN', 'ON      N2', 'MULT3.SA'),('PCAR3', 'P.ACUCAR-CBD', 'ON      NM', 'PCAR3.SA'),('PETR3', 'PETROBRAS', 'ON      N2', 'PETR3.SA'),('PETR4', 'PETROBRAS', 'PN      N2', 'PETR4.SA'),('PRIO3', 'PETRORIO', 'ON      NM', 'PRIO3.SA'),('PETZ3', 'PETZ', 'ON      NM', 'PETZ3.SA'),('POSI3', 'POSITIVO TEC', 'ON      NM', 'POSI3.SA'),('QUAL3', 'QUALICORP', 'ON      NM', 'QUAL3.SA'),('RADL3', 'RAIADROGASIL', 'ON      NM', 'RADL3.SA'),('RDOR3', 'REDE D OR', 'ON      NM', 'RDOR3.SA'),('RAIL3', 'RUMO S.A.', 'ON      NM', 'RAIL3.SA'),('SBSP3', 'SABESP', 'ON      NM', 'SBSP3.SA'),('SANB11', 'SANTANDER BR', 'UNT', 'SANB11.SA'),('CSNA3', 'SID NACIONAL', 'ON', 'CSNA3.SA'),('SULA11', 'SUL AMERICA', 'UNT     N2', 'SULA11.SA'),('SUZB3', 'SUZANO S.A.', 'ON  ED  NM', 'SUZB3.SA'),('TAEE11', 'TAESA', 'UNT     N2', 'TAEE11.SA'),('VIVT3', 'TELEF BRASIL', 'ON', 'VIVT3.SA'),('TIMS3', 'TIM', 'ON      NM', 'TIMS3.SA'),('TOTS3', 'TOTVS', 'ON      NM', 'TOTS3.SA'),('UGPA3', 'ULTRAPAR', 'ON      NM', 'UGPA3.SA'),('USIM5', 'USIMINAS', 'PNA     N1', 'USIM5.SA'),('VALE3', 'VALE', 'ON      NM', 'VALE3.SA'),('VIIA3', 'VIA', 'ON      NM', 'VIIA3.SA'),('VBBR3', 'VIBRA', 'ON      NM', 'VBBR3.SA'),('WEGE3', 'WEG', 'ON      NM', 'WEGE3.SA'),('YDUQ3', 'YDUQS PART', 'ON      NM', 'YDUQ3.SA')
    ON CONFLICT (symbol) do UPDATE
    SET
    symbol = EXCLUDED.symbol,
    name = EXCLUDED.name,
    type = EXCLUDED.type,
    yf_symbol = EXCLUDED.yf_symbol;

In [8]:
DB_ADDRESS = 'postgresql://postgres:admin@localhost/quant'
engine = create_engine(DB_ADDRESS)

In [9]:
engine.execute(query)

In [10]:
# Populando a tabela asset_portfolio
asset_sql = pd.read_sql('asset', engine, columns=['id', 'symbol'])
asset_sql

    id  symbol
0    1   RRRP3
1    2   ALPA4
2    3   ABEV3
3    4   AMER3
4    5   ASAI3
..  ..     ...
88  47   HAPV3
89  48   HYPE3
90  49  IGTI11
91  50   GNDI3
92  51   IRBR3

[93 rows x 2 columns]

In [11]:
portfolio_ibov = asset_sql.copy()[["id"]]
portfolio_ibov.rename(columns={'id': 'asset_id'}, inplace=True)
portfolio_ibov

    asset_id
0          1
1          2
2          3
3          4
4          5
..       ...
88        47
89        48
90        49
91        50
92        51

[93 rows x 1 columns]

In [12]:
portfolio_sql = pd.read_sql('portfolio', engine)
portfolio_sql

   id         name
0   1         IBOV
1   2  QuantBrasil

In [13]:
portfolio_ibov["portfolio_id"] = int(portfolio_sql.loc[portfolio_sql["name"] == "IBOV", 'id'])
portfolio_ibov

    asset_id  portfolio_id
0          1             1
1          2             1
2          3             1
3          4             1
4          5             1
..       ...           ...
88        47             1
89        48             1
90        49             1
91        50             1
92        51             1

[93 rows x 2 columns]

In [14]:
condition = asset_sql["symbol"].isin(["ELET3", "JHSF3", "MGLU3", "PETR4", "VALE3"])
portfolio_quantbr = asset_sql[condition].copy()
portfolio_quantbr.rename(columns={'id': 'asset_id'}, inplace=True)
portfolio_quantbr.drop('symbol', axis=1, inplace=True)
portfolio_quantbr

    asset_id
20        55
27        62
35        70
54        89
73        32

In [16]:
portfolio_quantbr["portfolio_id"] = int(
    portfolio_sql.loc[portfolio_sql["name"] == "QuantBrasil", 'id']
)
portfolio_quantbr

    asset_id  portfolio_id
20        55             2
27        62             2
35        70             2
54        89             2
73        32             2

In [17]:
asset_portfolio = pd.concat([portfolio_ibov, portfolio_quantbr], ignore_index=False)
asset_portfolio

    asset_id  portfolio_id
0          1             1
1          2             1
2          3             1
3          4             1
4          5             1
..       ...           ...
20        55             2
27        62             2
35        70             2
54        89             2
73        32             2

[98 rows x 2 columns]

In [19]:
insert_init = """
    INSERT INTO asset_portfolio(asset_id, portfolio_id)
    VALUES
"""
values = ",".join(["('{}', '{}')".format(row["asset_id"], row["portfolio_id"])
    for asset_id, row in asset_portfolio.iterrows()
])
insert_end = """
    ON CONFLICT(asset_id, portfolio_id) DO UPDATE
    SET asset_id = EXCLUDED.asset_id, portfolio_id = EXCLUDED.portfolio_id;
"""
query = insert_init + values + insert_end
engine.execute(query)